In [7]:
import pandas as pd

In [8]:
sensor_data = pd.read_csv('sensor_data.txt', names=('values',))

In [9]:
sensor_data

      values
0          5
1        445
2        444
3        445
4        444
...      ...
5528     445
5529     446
5530     446
5531     445
5532     445

[5533 rows x 1 columns]

In [10]:
sensor_data['normed_values'] = sensor_data['values']/sensor_data['values'].max()

In [12]:
sensor_data

      values  normed_values
0          5       0.009191
1        445       0.818015
2        444       0.816176
3        445       0.818015
4        444       0.816176
...      ...            ...
5528     445       0.818015
5529     446       0.819853
5530     446       0.819853
5531     445       0.818015
5532     445       0.818015

[5533 rows x 2 columns]

In [11]:
sensor_data[sensor_data["normed_values"]>0.5]

      values  normed_values
1        445       0.818015
2        444       0.816176
3        445       0.818015
4        444       0.816176
5        444       0.816176
...      ...            ...
5528     445       0.818015
5529     446       0.819853
5530     446       0.819853
5531     445       0.818015
5532     445       0.818015

[5531 rows x 2 columns]